# PANDAS

## 1. PANDAS DATA

### 1.1 SERIES

#### - 1차원 자료구조인 시리즈, 2차원 자료구조인 데이터프레임을 지원
#### - 각 열에 있는 데이터를 시리즈, 그 열들을 모은 것을 데이터 프레임이라고 함
#### - 모든 데이터 유형을 저장 할 수 있는 1차원 레이블이 지정된 배열

#### - 열 레이블을 총칭하여 인덱스라고 함

#### - 시리즈는 인덱스와 짝지어진 데이터로 되어 있음

In [46]:
import pandas as pd

In [47]:
series_data1 = pd.Series(['Dog', 'Cat', 'Tiger', 'Lion', 'Monkey'], \
                        index = [0, 2, 1, 3, 4])

In [48]:
series_data1

0       Dog
2       Cat
1     Tiger
3      Lion
4    Monkey
dtype: object

### 1.2 DICTIONARY TO SERIES

In [94]:
dict_data = {'a' : 1, 'b' : 2, 'c' : 3}

In [95]:
dict_data

{'a': 1, 'b': 2, 'c': 3}

In [51]:
series_data2 = pd.Series(dict_data)

key는 인덱스로 value는 데이터로

In [88]:
series_data2

a    1
b    2
c    3
dtype: int64

In [53]:
type(series_data2)

pandas.core.series.Series

### 1.3 LIST TO SERIES

In [54]:
list_data = ['Dog', 'Cat', 'Tiger']

series_data3 = pd.Series(list_data)
series_data3

0      Dog
1      Cat
2    Tiger
dtype: object

In [55]:
type(series_data3)

pandas.core.series.Series

### 1.4 TUPLE TO SERIES

In [56]:
tuple_data = ('이순신', '1991-03-15', '남자')

tuple_data

('이순신', '1991-03-15', '남자')

In [62]:
col_name = ['이름', '생년월일', '성별']

series_data4 = pd.Series(tuple_data, \
                        index = col_name)
series_data4

이름             이순신
생년월일    1991-03-15
성별              남자
dtype: object

In [63]:
type(series_data4)

pandas.core.series.Series

======================================================================================================

### 2.1 DATA FRAME

#### - 행과 열의 자료구조

#### - 서로 다른 종류의 값(숫자, 문자열, 불리언 등) 을 가질 수 있음

#### - 시리즈가 여러 개 합쳐진 것으로 볼 수 있음

### 2.2 DICTIONARY TO DATA FRAME

In [89]:
animal_age_data = {'동물' : ['Dog', 'Cat', 'Tiger', 'Lion', 'Monkey'],
                   '나이' : [7, 9, 2, 3, 1]}
print(animal_age_data)
type(animal_age_data)

{'동물': ['Dog', 'Cat', 'Tiger', 'Lion', 'Monkey'], '나이': [7, 9, 2, 3, 1]}

dict

In [73]:
df_animal_age = pd.DataFrame(animal_age_data)
df_animal_age

       동물  나이
0     Dog   7
1     Cat   9
2   Tiger   2
3    Lion   3
4  Monkey   1

### 2.3 LIST TO DATA FRAME

In [75]:
list_data = [['Dog', 7], ['Cat', 9],['Tiger', 2], ['Lion', 3], ['Monkey', 1]] # 5행 2열
list_data

[['Dog', 7], ['Cat', 9], ['Tiger', 2], ['Lion', 3], ['Monkey', 1]]

In [79]:
df2 = pd.DataFrame(list_data,
                  columns = ['animal', 'age'])
df2

   animal  age
0     Dog    7
1     Cat    9
2   Tiger    2
3    Lion    3
4  Monkey    1

In [80]:
type(df2)

pandas.core.frame.DataFrame

In [82]:
df2.dtypes

animal    object
age        int64
dtype: object

### 2.4 빈 DATA FRAME 만들기

In [86]:
df_null = pd.DataFrame()
df_null

Empty DataFrame
Columns: []
Index: []

컬럼 만들기

In [87]:
df_null['동물'] = 'Dog'
df_null

Empty DataFrame
Columns: [동물]
Index: []